app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2016-02-07 22:39:04.957665"], ["updated_at", "2016-02-07 22:39:04.957665"]]
INSERT INTO "songs" ("title", "first", "play_count", "f_g", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Fantasy Girl"], ["first", "1"], ["play_count", "3"], ["f_g", "0"], ["created_at", "2016-11-11 19:18:57.876196"], ["updated_at", "2016-11-11 19:18:57.876196"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      artist = Artist.find_or_create_by(name: song[1])